package DFS_BFS활용;
import java.util.Scanner;

// 설명 : 7*7 격자판 미로를 탈출하는 최단경로의 길이를 출력하는 프로그램을 작성하세요.
//       경로의 길이는 출발점에서 도착점까지 가는데 이동한 횟수를 의미한다.
//       출발점은 격자의 (1, 1) 좌표이고, 탈출 도착점은 (7, 7)좌표이다. 격자판의 1은 벽이고, 0은 도로이다.
//       격자판의 움직임은 상하좌우로만 움직인다. 미로가 다음과 같다면
//       출발 0 0 0 0 0 0
//         0 1 1 1 1 1 0
//         0 0 0 1 0 0 0
//         1 1 0 1 0 0 0
//         1 1 0 0 0 0 1
//         1 1 0 1 1 0 0
//         1 0 0 0 0 0 도착
//       위와 같은 경로가 최단 경로의 길이는 12이다.
// 입력 예시 : 0 0 0 0 0 0 0
//           0 1 1 1 1 1 0
//           0 0 0 1 0 0 0
//           1 1 0 1 0 1 1
//           1 1 0 1 0 0 0
//           1 0 0 0 1 0 0
//           1 0 1 0 0 0 0
// 출력 예시 : 12

public class 미로의최단거리통로 {
    
    public static void main(String[] args) {
        미로의최단거리통로  m = new 미로의최단거리통로();
        Scanner sc = new Scanner(System.in);

    }
}
